%¬вод:    y' = f - правая часть ƒ” 
%         a, b - границы интервала поиска решения [a,b] 
%         ya - начальное условие ya = y(a)
%         N - количество шагов
%¬ывод:   T - вектор значений независимой переменной
%         Y - вектор значений функции

f = inline('2*T.^2+2*Y','T','Y');
a = 0; b = 1;
ya= 1;
N = 10;

h = (b-a)/N;
T = zeros(1,N+1);
Y = zeros(1,N+1);
T = a:h:b;
Y(1) = ya;
for j=1:N
   k1 = f(T(j),Y(j));
   k2 = f(T(j+1),Y(j)+h*k1); 
   Y(j+1) = Y(j)+(h/2)*(k1+k2);
end

H=[T' Y']